[
    { title: "חוק הגנת הצרכן תיקון - פנייה מקדימה בעסקת מכר מרחוק", state: "עברה קריאה טרומית" },
    { title: "חוק המקרקעין (חיזוק בתים משותפים מפני רעידות אדמה) תיקון - סידור חלוף ארעי", state: "הוסבה לנושא לדיון" },
    { title: "חוק שכר מינימום תיקון - שכר מינימום לעובד שטרם מלאו לו 18 שנים", state: "הוסבה לנושא לדיון" },
    { title: "חוק הפסיכולוגים תיקון - הפרת חובת דיווח ופרסום החלטות ועדת המשמעת", state: "עברה קריאה טרומית" },
    { title: "חוק הביטוח הלאומי תיקון - שיעור ההטבה לפי הסכם בדבר גמלת ניידות", state: "נפלה בקריאה טרומית" }
].each_with_index do |params, i|
  b = Bill.create!(params)
  b.create_bill_prediction(prediction: ((i * 20) % 101))
end
